# ConstraintsCanBeEdited Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Rebar..::..ConstraintsCanBeEdited Method
Rebar Class See Also
---
For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. Examples of where this method would return false are: Rebar in Groups (which do not have constraints), or legacy, sketch-based Rebar elements created before the introduction of RebarShape families in version 2009.
For FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ConstraintsCanBeEdited()
```

Visual Basic
---
```text
Public Function ConstraintsCanBeEdited As Boolean
```

Visual C++
---
```text
public:
bool ConstraintsCanBeEdited()
```

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace